## 확률 
# 확률은 경우의 수에서 생각할 수 있는 모든 경우의 수 중에 우리가 관심으 갖는 경우의 수가 차지하는 비율로 생각할 수 있다. 
# =용어= 
# - 시행: 다양한 결과가 나올 수 있느 어떤 것을 실제로 하는 것을 말함 
#       ex) 주사위 던진다, 복권을 긁는다
# - 표본공간: 가능한 모든 결과의 모임 (Sample space)
#       : ex) 동전던지기 (앞앞) (앞뒤) (뒤앞) (뒤뒤), 814만분의 1이 표본공간
# - 사건: 가능한 결과들 중 어떤 요구사항을 만족하는 것, 로또 복권 추첨의 결과 "6개의 숫자가 연속이다", "모두 홀수가 나온다"..등 
#       중요한 것은 "사건"이 단 하나의 결과를 의미하지 않을 수도 있다 . 
# - 배반사건: 동시에 일어날 수 없는 두 사건 (Mutually Exclusive Event)
# - 여사건: 어떤 사건이 일어나지 않는 것을 말함  
#         복권 추첨 결과가 "모든 숫자가 짝수이다" => 홀수가 하나라도 나오거나 모든 숫자가 홀수인 것 
#         즉, "적어도 하나는 홀수이다. "